In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.shape

(891, 12)

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
891*30/100

267.3

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
for i in df.columns:
    if(df[i].isnull().sum() >=891*30/100):
        df= df.drop(columns=[i],axis=1)

In [9]:
df.shape

(891, 11)

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [11]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [12]:
df= df.dropna()

In [13]:
df=df.reset_index(drop=True)

In [14]:
df.shape

(712, 11)

In [15]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [17]:
df= df.drop(columns=['Name','Ticket'],axis=1)

In [18]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [19]:
len(df['Sex'].unique())

2

In [20]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [21]:
len(df['Embarked'].unique())

3

In [22]:
from sklearn.preprocessing import OneHotEncoder
Sex=OneHotEncoder()
Embarked=OneHotEncoder()

In [23]:
Sex.fit(df[['Sex']])
Embarked.fit(df[['Embarked']])

OneHotEncoder()

In [24]:
sex_df = pd.DataFrame(Sex.fit_transform(df[['Sex']]).toarray())
embar_df = pd.DataFrame(Embarked.transform(df[['Embarked']]).toarray())

In [25]:
embar_df.head()

     0    1    2
0  0.0  0.0  1.0
1  1.0  0.0  0.0
2  0.0  0.0  1.0
3  0.0  0.0  1.0
4  0.0  0.0  1.0

In [26]:
sex_df.head()

     0    1
0  0.0  1.0
1  1.0  0.0
2  1.0  0.0
3  1.0  0.0
4  0.0  1.0

In [27]:
sex_df.rename(columns = {0:'sex0',1:'sex1'},inplace=True)
embar_df.rename(columns = {0:'embar0',1:'embar1',2:'embar2'},inplace=True)

In [28]:
sex_df.head()

   sex0  sex1
0   0.0   1.0
1   1.0   0.0
2   1.0   0.0
3   1.0   0.0
4   0.0   1.0

In [29]:
df = df.join(sex_df)
df = df.join(embar_df)

In [30]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,sex0,sex1,embar0,embar1,embar2
0,1,0,3,male,22.0,1,0,7.2500,S,0.0,1.0,0.0,0.0,1.0
1,2,1,1,female,38.0,1,0,71.2833,C,1.0,0.0,1.0,0.0,0.0
2,3,1,3,female,26.0,0,0,7.9250,S,1.0,0.0,0.0,0.0,1.0
3,4,1,1,female,35.0,1,0,53.1000,S,1.0,0.0,0.0,0.0,1.0
4,5,0,3,male,35.0,0,0,8.0500,S,0.0,1.0,0.0,0.0,1.0

In [31]:
df= df.drop(columns=['Sex','Embarked'],axis=1)

In [32]:
df.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,sex0,sex1,embar0,embar1,embar2
0,1,0,3,22.0,1,0,7.2500,0.0,1.0,0.0,0.0,1.0
1,2,1,1,38.0,1,0,71.2833,1.0,0.0,1.0,0.0,0.0
2,3,1,3,26.0,0,0,7.9250,1.0,0.0,0.0,0.0,1.0
3,4,1,1,35.0,1,0,53.1000,1.0,0.0,0.0,0.0,1.0
4,5,0,3,35.0,0,0,8.0500,0.0,1.0,0.0,0.0,1.0

In [33]:
X=df.drop(columns=['Survived'],axis=1)

In [34]:
y=df[['Survived']]

In [35]:
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
X_train,X_test,y_train,y_test=train_test_split(X,y)

In [36]:
Decision=DecisionTreeClassifier()
Decision.fit(X_train,y_train)

DecisionTreeClassifier()

In [37]:
pred=Decision.predict(X_test)

In [38]:
X_test.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,sex0,sex1,embar0,embar1,embar2
163,207,3,32.0,1,0,15.8500,0.0,1.0,0.0,0.0,1.0
343,431,1,28.0,0,0,26.5500,0.0,1.0,0.0,0.0,1.0
52,71,2,32.0,0,0,10.5000,0.0,1.0,0.0,0.0,1.0
36,51,3,7.0,4,1,39.6875,0.0,1.0,0.0,0.0,1.0
157,200,2,24.0,0,0,13.0000,1.0,0.0,0.0,0.0,1.0

In [39]:
out=y_test.copy()

In [40]:
out['predicted']=pred
out['Survived']=y_test['Survived']

In [41]:
out.head()

     Survived  predicted
163         0          1
343         1          1
52          0          1
36          0          0
157         0          1

In [42]:
out=out.reset_index(drop=True)
out.head()

   Survived  predicted
0         0          1
1         1          1
2         0          1
3         0          0
4         0          1

In [43]:
out=out.sort_values(by=['Survived'])
out.head()

     Survived  predicted
0           0          1
103         0          0
104         0          0
105         0          0
106         0          0

In [44]:
out=out.reset_index(drop=True)
out.head()

   Survived  predicted
0         0          1
1         0          0
2         0          0
3         0          0
4         0          0

In [45]:
score = Decision.score(X_test, y_test)
score

0.7584269662921348